/*+----------------------------------------------------------------+
  |	Title:		DialogHelper.hpp [共通環境]
  |	Comment:	ダイアログヘルパー
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __DIALOG_HELPER_HPP__
#define __DIALOG_HELPER_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// ダイアログヘルパー
//----------------------------------------
class CDialogHelper{
public:
	// ダイアログ呼び出し
	static void CallDialog(
        const char* pTitle,         // 表示タイトル
        const char* pMess,          // 表示文言
        const char* pPositive,      // 肯定ボタン文言（YES)
        const char* pNeutral,       // 中立ボタン文言（SKIP）
        const char* pNegative       // 否定ボタン文言（NO）
    );
    
    // 入力ダイアログ呼び出し
	static void CallDialogInputString(
        const char* pTitle,         // 表示タイトル
        const char* pMess,          // 表示文言
        const char* pPositive,      // 肯定ボタン文言（YES）
        const char* pNeutral,       // 中立ボタン文言(SKIP)
        const char* pNegative,      // 否定ボタン文言（NO）
        const char* pDefault        // デフォルト入力文言
    );

	// 終了検出
	static bool IsBusy( void );

	// ダイアログ入力取得
	static bool IsSelectedPositive( void );
	static bool IsSelectedNeutral( void );
	static bool IsSelectedNegative( void );
    
    // 入力文言取得
	static void GetInputString( char* pBuf, int sizeBuf );

private:
	// インスタンス生成は不可
	CDialogHelper( void ){};
	virtual ~CDialogHelper( void ){};
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
#endif	// __DIALOG_HELPER_HPP__
