/*+----------------------------------------------------------------+
  |	Title:		TexStringMgr.hpp [共通環境]
  |	Comment:	テクスチャ文字列管理
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __TEX_STRING_MGR_HPP__
#define __TEX_STRING_MGR_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"
#include "TexString.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// テクスチャ文字列管理
//----------------------------------------
class CTexStringMgr{
private:
	// 管理データ
	static CTexString* s_oArrTexString;

public:
	// 開始＆終了
    static bool OnCreate( void );
    static void OnDestroy( void );

    // 更新
    static void Update( void );

    // 使用数取得
    static int GetTexStringNumMax( void );
    static int GetTexStringNumUse( void );

    // テクスチャ取得（※キャッシュにあればキャッシュから、なければ作成）
    static CTex* GetTex( const char *pStr, int type=0, int size=32 );

private:
	// インスタンス作成は不可
	CTexStringMgr( void ){}
	virtual ~CTexStringMgr( void ){}
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
#endif	// __TEX_STRING_MGR_HPP__
