/*+----------------------------------------------------------------+
  |	Title:		CsvCell.hpp [共通環境]
  |	Comment:	CSV要素（※CSVテーブルで管理される読み込み主体のデータ）
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __CSV_CELL_HPP__
#define __CSV_CELL_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"
#include "FileHeader.hpp"
#include "loop/node/EditValueMenu.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
//===============================================================
// 基本実装：CSVデータ処理（※書き込みには対応しない）（※クラス定義内に記載）
//（※[.cpp]にて各メソッドを実装すること）
//===============================================================
#define IMPLEMENT_CSV()                                         \
    public:                                                     \
        static int GetBinSize( void );                          \
    public:                                                     \
        void clear( void );                                     \
        void read( CInputBuffer* pIB );

//===============================================================
// 追加実装：データの編集（※クラス定義内に記載）
//（※[.cpp]にて各メソッドを実装すること）
//===============================================================
#define IMPLEMENT_CSV_EDIT()                                    \
    public:                                                     \
        void setEditValueMenu( CEditValueMenu* pMenu );

/*+----------------------------------------------------------------+
  |	Struct		構造体定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
// 基底クラス[CCsvCell]から各クラスを派生させて
// 取り扱いを共通化する需要はなさそうなのでクラス定義はしないでおく

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
extern bool csv_cell_ready_with_error_log( const char* pFilePath, CInputBuffer* pIB, CFileHeader* pFH,
                                           int numData, int sizeData, const char* pLabelForError );

#endif	// __CSV_CELL_HPP__
