/*+----------------------------------------------------------------+
  |	Title:		EditValue.hpp [共通環境]
  |	Comment:	値編集処理：[int32]で収まる範囲の数値のみに対応
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __EDIT_VALUE_HPP__
#define __EDIT_VALUE_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
//-----------------------------------------------------------------
// 編集対象タイプ（※[UINT32]には対応しない＝内部的に[int32]で処理するので）
//-----------------------------------------------------------------
enum eEDIT_VALUE_TYPE{
	eEDIT_VALUE_TYPE_INT8,      // char
	eEDIT_VALUE_TYPE_UINT8,     // unsigned char
    
	eEDIT_VALUE_TYPE_INT16,     // short
	eEDIT_VALUE_TYPE_UINT16,    // unsigned short
    
	eEDIT_VALUE_TYPE_INT32,     // int
};

/*+----------------------------------------------------------------+
  |	Struct		構造体型宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// 値編集ダイアログ
//----------------------------------------
class CEditValue{
public:
	// 値の取得（※[ForBit]の返値の意味は、０でビットが寝ている、１（非０）でビットが立っている）
	static int32 GetValue( void* pVal, eEDIT_VALUE_TYPE type );
	static int32 GetValueForBit( void* pVal, eEDIT_VALUE_TYPE type, int bit );

	// 値の設定（※[ForBit]への指定は、０でビットを寝かせる、１（非０）でビットを立たせる）
	static bool SetValue( void* pVal, eEDIT_VALUE_TYPE type, int val );
	static bool SetValueForBit( void* pVal, eEDIT_VALUE_TYPE type, int val, int bit );

	// 値のスワップ（※０を１（非０）に、１（非０）０に）
	static void SwapValue( void* pVal, eEDIT_VALUE_TYPE type );
	static void SwapValueForBit( void* pVal, eEDIT_VALUE_TYPE type, int bit );

private:
	CEditValue( void ){}
	~CEditValue( void ){}
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
#endif /* __EDIT_VALUE_HPP__ */
