/*+----------------------------------------------------------------+
  |	Title:		ScrollBarMenu.hpp [共通環境]
  |	Comment:	スクロールバー付きメニュー（※基本的にデバッグ処理用）
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __SCROLL_BAR_MENU_HPP__
#define __SCROLL_BAR_MENU_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"
#include "Menu.hpp"
#include "ScrollBar.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体型宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// スクロールバーメニュー
//----------------------------------------
class CScrollBarMenu: public CMenu{
protected:
	// スクロールバー（※実体でもつ）
	CScrollBar m_oScrollBar;

public:
    // コンストラクタ／デストラクタ（※メニューの見た目に関わる設定はコンストラクタでのみ行う想定）
	CScrollBarMenu( eGRP grpId, int cW, int cH );
	virtual ~CScrollBarMenu( void );

	virtual void enter( void );
	virtual void exit( void );
	virtual void setActive( bool flag );
	virtual void fixMenu( void );

protected:
	virtual void onUpdate0( void );
	virtual void onDraw0( void );
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
#endif /* __SCROLL_BAR_MENU_HPP__ */
