/*+----------------------------------------------------------------+
  |	Title:		util_utf8.hpp [共通環境]
  |	Comment:	utf8関連
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __UTIL_UTF8_HPP__
#define __UTIL_UTF8_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Function	関数
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体型宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
// [utf8]でエンコードされた[char]配列から[utf8]でみた文字数を取得する
extern int util_utf8_get_len( const char* pSrc0 );

// [utf8]でエンコードされた[char]配列を[int]配列に変換（※この時点では単にバイト配列を結合するだけ）
extern bool util_utf8_conv_to_int_array( int* pArrI, int sizeArrI, const char* pSrc0, int* pLen=NULL );

// [utf8]エンコードされた[int]値を、[Unicode]に変換
extern int util_utf8_decode( int data );

// [Unicode]でエンコードされた[char]配列を[utf8]に変換
extern bool util_utf8_conv_from_unicode( char* pDest, int sizeDest, const char* pSrc0, int* pLen=NULL );

#endif /* __UTIL_UTF8_HPP__ */
