/*+----------------------------------------------------------------+
  |	Title:		util_pcm.hpp [共通環境]
  |	Comment:	PCM関連(※[pcmconv.exe]の実装に依存)
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __UTIL_PCM_HPP__
#define __UTIL_PCM_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Function	関数
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体型宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
// PCMデータのデコード： [16bit][モノラル]
extern int util_pcm_decode_16bit_mono( short* pDest, BYTE* pBuff, int len );

// ADPCMデータのデコード: [16bit][モノラル]
extern int util_pcm_decode_adpcm_16bit_mono( short* pDest, BYTE* pBuff, int len );

// ADPCMデータのデコード: [16bit][ステレオ]の左右
extern int util_pcm_decode_adpcm_16bit_stereoL( short* pDest, BYTE* pBuffL, int len );
extern int util_pcm_decode_adpcm_16bit_stereoR( short* pDest, BYTE* pBuffR, int len );

#endif /* __UTIL_PCM_HPP__ */
