/*+----------------------------------------------------------------+
  |	Title:		StrokeDot.hpp [共通環境]
  |	Comment:	ストローク画素（※ストロークの描画に利用される画素部分）
  |             １ピクセル未満のはみ出し段階に応じた画像を総当たりでもつ仕組み
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __STROKE_DOT_HPP__
#define __STROKE_DOT_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"
#include "StrokeConst.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体型宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// ストローク画素
//----------------------------------------
class CStrokeDot{
public:
    // 領域確保情報（※端末の解像度によって確保数とサイズが変動する）
    static int GetAllocCellNum( void );
    static int GetAllocSize( float size0 );
    
    // サイズ調整
    static int FixDotSize( float size0 );
        
protected:
    int m_nSizeDot;         // 画素サイズ（※素材サイズにはみ出し余白分を足したもの）
    
    BYTE* m_pBufDot;        // 画素バッファ実体
    BYTE** m_pArrDot;       // はみ出し精度毎の画素バッファアクセス先

public:
    // コンストラクタ／デストラクタ
    CStrokeDot( void );
	virtual ~CStrokeDot( void );
    
    // クリア
    void clear( void );

    // 取得
    inline int getSizeDot( void ){ return( m_nSizeDot ); }

    //---------------------------------------------------------------
    // ストローク画素取得：ドットのはみ出し具合による画素バッファを返す
    // はみ出し具合を[rateOutX/rateOutY]にて[0.0f-1.0f)の範囲で指定する
    //---------------------------------------------------------------
    BYTE* getDot( float rateOutX, float rateOutY );

    //---------------------------------------------------------------
    // ストローク画素作成（※渡された画素[pSrc]の内容で階調毎のはみ出し画素を生成）
    // [pSrc]は[sizeSrc*sizeSrc]サイズの正方形画像を想定
    //---------------------------------------------------------------
    bool createDot( BYTE* pSrc, int sizeSrc );

protected:
    // ストローク確定
    void fixDot( BYTE* pDot, int sizeDot, int outX, int outY, BYTE* pSrc );
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
#endif	/* __STROKE_DOT_HPP__ */
