/*+----------------------------------------------------------------+
  |	Title:		types.hpp [共通環境]
  |	Comment:	型定義
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef	__TYPES_HPP__
#define	__TYPES_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
//---------------------------------
// 符号付き／符号なし整数
//---------------------------------
typedef signed char     	int8;
typedef unsigned char   	uint8;
typedef signed short    	int16;
typedef unsigned short  	uint16;
typedef signed int			int32;
typedef unsigned int		uint32;
typedef signed long long    int64;
typedef unsigned long long  uint64;

//---------------------------------
// データ型
//---------------------------------
// １ワードのバイト長は「２」としている
//---------------------------------
#define BYTE				uint8
#define WORD				uint16
#define DWORD				uint32
#define QWORD               uint64
#define ADDR				uintptr_t

#endif /* __TYPES_HPP__ */
