/*+----------------------------------------------------------------+
  |	Title:		FrameBufferBinData.hpp [共通環境]
  |	Comment:	フレームバッファバイナリデータ
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __FRAME_BUFFER_BIN_DATA_HPP__
#define __FRAME_BUFFER_BIN_DATA_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// フレームバッファバイナリデータ
//----------------------------------------
class CFrameBufferBinData{
public:
    //------------------------
    // バイナリサイズ取得
    //------------------------
    inline static int GetBinSize( void ){
        return( 2*2 + 4 + 4*1 );
    }

protected:
    //------------------------
    // メンバー
    //------------------------
    int16  m_nWidth;            // [2]: 横幅
    int16  m_nHeight;           // [2]: 縦幅
    uint32 m_nOption;           // [4]: オプション
    uint8  m_nR;                // [1]: クリア色：赤
    uint8  m_nG;                // [1]: クリア色：緑
    uint8  m_nB;                // [1]: クリア色：青
    uint8  m_nA;                // [1]: クリア色：α

public:
    //------------------------
    // コンストラクタ／デストラクタ
    //------------------------
    CFrameBufferBinData(){}
    virtual ~CFrameBufferBinData(){}

    //------------------------
    // 取得
    //------------------------
    inline int getWidth( void ){ return( m_nWidth ); }
    inline int getHeight( void ){ return( m_nHeight ); }
    inline DWORD getOption( void ){ return( m_nOption ); }
    inline BYTE getR( void ){ return( m_nR ); }
    inline BYTE getG( void ){ return( m_nG ); }
    inline BYTE getB( void ){ return( m_nB ); }
    inline BYTE getA( void ){ return( m_nA ); }

    //-----------------------------------------------------
    // 読み込み（※[pIB]は有効である前提＆値の整合性等の判断はしない）
    //-----------------------------------------------------
    inline void read( CInputBuffer* pIB ){
        m_nWidth = pIB->readInt16();
        m_nHeight = pIB->readInt16();
        m_nOption = pIB->readUint32();
        m_nR = pIB->readUint8();
        m_nG = pIB->readUint8();
        m_nB = pIB->readUint8();
        m_nA = pIB->readUint8();
    }
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
#endif	// __FRAME_BUFFER_BIN_DATA_HPP__
