/*+----------------------------------------------------------------+
  |	Title:		DrawCommon.hpp [共通環境]
  |	Comment:	表示共通
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __DRAW_COMMON_HPP__
#define __DRAW_COMMON_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// 表示共通
//----------------------------------------
class CDrawCommon{
public:
	// 窓の表示：グループ
	static void RenderWindow( eGRP grpId, float x, float y, float wC, float hC, float sX, float sY,
                              int rgba=0xFFFFFFFF, eIMG palId=eIMG_INVALID, float* pW=NULL, float* pH=NULL, bool isCalcOnly=false );

	// 窓の表示：矩形
	static void RenderWindowRect( float x, float y, float wC, float hC, DWORD rgbaBase, DWORD rgbaBorder,
                                  float mX=7, float mY=7, float border=3 );

private:
	// インスタンス作成は不可
	CDrawCommon( void ){}
	virtual ~CDrawCommon( void ){}
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/

#endif	// __DRAW_COMMON_HPP__
