/*+----------------------------------------------------------------+
  |	Title:		LogicConst.cpp [共通環境]
  |	Comment:	ロジック定数関連（※ロジックプレイに関わる定数関連）
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"
#include "LogicConst.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
// ラベル：ロジック状況
const char* g_pArrLabelLogicStatus[] = {
    "PLAYING",
    "CLEAR",
    "IMCOMPATIBLE",
    "GIVE_UP",

    NULL
};

// ラベル：マスタイプ
const char* g_pArrLabelLogicSolidType[] = {
    "BLACK",
    "WHITE",
    
    NULL,
};

// ラベル：マス状況
const char* g_pArrLabelLogicSolidStatus[] = {
    "DETERMINED",
    "ASSUMED",
    "ASSUMED_START",
    
    NULL,
};

// ラベル：ヒント状況
const char* g_pArrLabelLogicClueStatus[] = {
    "DETERMINED",
    "ASSUMED",
    "IMCOMPATIBLE",
    
    NULL,
};

// ラベル：ライン状況
const char* g_pArrLabelLogicLineStatus[] = {
    "DETERMINED",
    "ASSUMED",
    "IMCOMPATIBLE",
    
    NULL,
};

/*+----------------------------------------------------------------+
  |	Prototype	プロト宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Program		プログラム実装
  +----------------------------------------------------------------+*/
