/*+----------------------------------------------------------------+
  |	Title:		LogicSkin.cpp [共通環境]
  |	Comment:	ロジック：スキン要素基底（※画面の見た目を差し替える場合に継承）
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"
#include "LogicSkin.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体型宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
const char* g_pArrLabelLogicSkinType[] = {
    "NORMAL",
    
    NULL,
};

/*+----------------------------------------------------------------+
  |	Program		プログラム実装
  +----------------------------------------------------------------+*/
//-----------------------
// コンストラクタ
//-----------------------
CLogicSkin::CLogicSkin( void ){
    clearLogicSkin();
}

//-----------------------
// クリア
//-----------------------
void CLogicSkin::clearLogicSkin( void ){
    m_eSkinType = eLOGIC_SKIN_TYPE_INVALID;
}

//-----------------------
// スキン設定
//-----------------------
void CLogicSkin::setLogicSkinType( eLOGIC_SKIN_TYPE skinType ){
    // スキンの指定が変わったら
    if( m_eSkinType != skinType ){
        m_eSkinType = skinType;
        fixForSkinType();
    }
}

//-----------------------
// スキン設定
//-----------------------
eLOGIC_SKIN_TYPE CLogicSkin::getLogicSkinType( void ){
    // TODO:クラス設定等を見るべきか？
    return( m_eSkinType );
}

//-----------------------
// スキンの確定
//-----------------------
void CLogicSkin::fixForSkinType( void ){
    // 特に無し
}
